import streamlit as st # Εισαγωγή βιβλιοθήκης για την δημιουργία web εφαρμογών

# Τιτλος σελιδας στο browser
st.set_page_config("SmartCart App")

# Τίτλος σελίδας στο UI
st.title("Καλώς ήρθατε στο UniShop")

# Πράσινο μήνυμα στο sidebar
st.sidebar.success("Επιλέξτε μια σελίδα")

# Κείμενο σελίδας
st.markdown(
    """
    Αυτή είναι η αρχική σελίδα της εφαρμογής.
      Από το μενού αριστερά μπορείτε να επιλέξετε μια σελίδα.  
      Η σελίδα Products εμφανίζει τα προιόντα του UniShop.  
      Η σελίδα Cart εμφανίζει το καλάθι αγοράς, τα προιόντα που περιέχει και μπορεί να γίνει αξιολόγηση του.  
      Η σελίδα Purchases εμφανίζει τις προηγούμενες αγορές.  
      Στην σελίδα Web Scraping μπορείτε να αναζητήσετε πληροφορίες για τα προιόντα σε άλλες ιστοσελίδες.  
      Στην σελίδα Analysis μπορείτε να πραγματοποιήσετε αναλύσεις σχετικά με τις αγορές.  
    """
)
